#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Plan 📖`success`
#### Terraform Validation 🤖`success`

<details><summary>Show Plan</summary>

```

terraform
Running plan in Terraform Cloud. Output will stream here. Pressing Ctrl-C
will stop streaming the logs, but will not stop the plan running remotely.

Preparing the remote plan...

To view this run in a browser, visit:
https://app.terraform.io/app/blackboards/infrastructure/runs/run-KvHsJYDUdZcEPCvF

Waiting for the plan to start...

Terraform v1.4.5
on linux_amd64
Initializing plugins and modules...
module.config_bucket.random_id.this[0]: Refreshing state... [id=aPbH]
module.remote_state_bucket.random_id.this[0]: Refreshing state... [id=WvCN]
module.postgres_backups_bucket.random_id.this[0]: Refreshing state... [id=Ze9c]
digitalocean_ssh_key.secondary: Refreshing state... [id=38557683]
digitalocean_ssh_key.m2: Refreshing state... [id=38210829]
digitalocean_droplet.postgres: Refreshing state... [id=359948759]
module.demo_f2_instance.data.aws_iam_policy_document.ec2_assume_role: Refreshing...
aws_route53_record.demo_opentracker: Refreshing state... [id=Z03017682LQ8TW5YUFGE0_testing_A]
module.f2_instance.data.aws_iam_policy_document.ec2_assume_role: Refreshing...
aws_iam_policy.iac_deployer: Refreshing state... [id=arn:aws:iam::558855412466:policy/iac-deployer-policy]
aws_iam_user.postgres_backups: Refreshing state... [id=postgres.backups]
aws_key_pair.main: Refreshing state... [id=macbook-m2-pro]
module.demo_f2_instance.data.aws_iam_policy_document.ec2_assume_role: Refresh complete after 0s [id=2851119427]
module.postgres_backups.aws_s3_bucket.this: Refreshing state... [id=postgres-backups-tr1pjq]
module.postgres_backups_bucket.aws_s3_bucket.this: Refreshing state... [id=postgres-backups-65ef5c]
aws_iam_user.configuration_deployer: Refreshing state... [id=configuration.deployer]
module.f2_instance.data.aws_iam_policy_document.ec2_assume_role: Refresh complete after 0s [id=2851119427]
module.config_bucket.aws_s3_bucket.this: Refreshing state... [id=configuration-68f6c7]
aws_vpc.main: Refreshing state... [id=vpc-0d1ab7c53aec22955]
aws_iam_user.github_actions: Refreshing state... [id=github.actions]
module.remote_state_bucket.aws_s3_bucket.this: Refreshing state... [id=terraform-remote-state-5af08d]
module.remote_state.aws_s3_bucket.this: Refreshing state... [id=terraform-remote-state-m3rc9k]
module.configuration_bucket.aws_s3_bucket.this: Refreshing state... [id=configuration-sfvz2s]
aws_route53_zone.opentracker: Refreshing state... [id=Z03017682LQ8TW5YUFGE0]
aws_iam_user.personal: Refreshing state... [id=alex.jackson]
module.demo_f2_instance.aws_iam_role.this: Refreshing state... [id=demo-role]
module.f2_instance.aws_iam_role.this: Refreshing state... [id=f2-role]
aws_iam_access_key.configuration_deployer: Refreshing state... [id=AKIAYEHTA3LZKXOXWTYC]
aws_iam_access_key.postgres_backups: Refreshing state... [id=AKIAYEHTA3LZFDVAEC42]
aws_iam_access_key.github_actions: Refreshing state... [id=AKIAYEHTA3LZK6JIHCYE]
digitalocean_project.blackboards: Refreshing state... [id=d006b183-c896-4d41-a341-fb46d729eeb6]
aws_iam_role.iac_deployer: Refreshing state... [id=iac-deployer]
aws_iam_user_login_profile.personal: Refreshing state... [id=alex.jackson]
aws_iam_access_key.personal: Refreshing state... [id=AKIAYEHTA3LZCH5CBE4Y]
module.demo_f2_instance.aws_iam_instance_profile.this: Refreshing state... [id=demo-instance-profile]
module.f2_instance.aws_iam_instance_profile.this: Refreshing state... [id=f2-instance-profile]
aws_iam_user_policy.github_actions: Refreshing state... [id=github.actions:github.actions.policy]
aws_iam_role_policy_attachment.iac_deployer: Refreshing state... [id=iac-deployer-20230421061924179000000001]
aws_internet_gateway.main: Refreshing state... [id=igw-0aa2c09bec52493fc]
module.demo_f2_instance.aws_security_group.this: Refreshing state... [id=sg-04fb5c866d5771529]
aws_subnet.main: Refreshing state... [id=subnet-07936cc0e5c7d83b1]
module.f2_instance.aws_security_group.this: Refreshing state... [id=sg-0b0c2706a115cea15]
aws_route_table.gateway: Refreshing state... [id=rtb-0881a403738fea9c7]
module.demo_f2_instance.aws_security_group_rule.allow_inbound_ssh: Refreshing state... [id=sgrule-221824754]
module.demo_f2_instance.aws_security_group_rule.allow_outbound_http: Refreshing state... [id=sgrule-3003896291]
module.demo_f2_instance.aws_security_group_rule.allow_outbound_ssh: Refreshing state... [id=sgrule-1601919452]
module.demo_f2_instance.aws_security_group_rule.allow_outbound_postgres: Refreshing state... [id=sgrule-3693269301]
module.demo_f2_instance.aws_security_group_rule.allow_outbound_https: Refreshing state... [id=sgrule-2111923803]
module.demo_f2_instance.aws_security_group_rule.allow_inbound_https: Refreshing state... [id=sgrule-2126924366]
module.config_bucket.aws_s3_bucket_versioning.this: Refreshing state... [id=configuration-68f6c7]
module.postgres_backups_bucket.aws_s3_bucket_versioning.this: Refreshing state... [id=postgres-backups-65ef5c]
module.f2_instance.aws_security_group_rule.allow_outbound_ssh: Refreshing state... [id=sgrule-3670505610]
module.f2_instance.aws_security_group_rule.allow_outbound_https: Refreshing state... [id=sgrule-3714648427]
module.f2_instance.aws_security_group_rule.allow_outbound_postgres: Refreshing state... [id=sgrule-1497175691]
module.f2_instance.aws_security_group_rule.allow_inbound_ssh: Refreshing state... [id=sgrule-2411040274]
module.f2_instance.aws_security_group_rule.allow_outbound_http: Refreshing state... [id=sgrule-918024373]
module.f2_instance.aws_security_group_rule.allow_inbound_https: Refreshing state... [id=sgrule-1488974477]
aws_route_table_association.gateway: Refreshing state... [id=rtbassoc-041dbac3ebba9c5ca]
module.remote_state_bucket.aws_s3_bucket_versioning.this: Refreshing state... [id=terraform-remote-state-5af08d]
aws_iam_user_policy.configuration_deployer: Refreshing state... [id=configuration.deployer:configuration.deployer.policy]
module.postgres_backups.aws_s3_bucket_versioning.this: Refreshing state... [id=postgres-backups-tr1pjq]
module.postgres_backups.aws_s3_bucket_lifecycle_configuration.this[0]: Refreshing state... [id=postgres-backups-tr1pjq]
module.remote_state.aws_s3_bucket_versioning.this: Refreshing state... [id=terraform-remote-state-m3rc9k]
module.remote_state.aws_s3_bucket_lifecycle_configuration.this[0]: Refreshing state... [id=terraform-remote-state-m3rc9k]
module.configuration_bucket.aws_s3_bucket_lifecycle_configuration.this[0]: Refreshing state... [id=configuration-sfvz2s]
module.configuration_bucket.aws_s3_bucket_versioning.this: Refreshing state... [id=configuration-sfvz2s]
module.f2_instance.data.aws_subnet.self: Refreshing...
module.f2_instance.data.aws_subnet.self: Refresh complete after 0s [id=subnet-07936cc0e5c7d83b1]
module.f2_instance.aws_instance.this: Refreshing state... [id=i-0b5ea915378ecc291]
module.demo_f2_instance.data.aws_subnet.self: Refreshing...
module.demo_f2_instance.aws_instance.this: Refreshing state... [id=i-07bc925252a31d2c8]
module.demo_f2_instance.data.aws_subnet.self: Refresh complete after 0s [id=subnet-07936cc0e5c7d83b1]
module.f2_instance.aws_iam_policy.this: Refreshing state... [id=arn:aws:iam::558855412466:policy/f2-policy]
module.demo_f2_instance.aws_iam_policy.this: Refreshing state... [id=arn:aws:iam::558855412466:policy/demo-policy]
aws_iam_user_policy.postgres_backups: Refreshing state... [id=postgres.backups:postgres.backups.policy]
aws_iam_user_policy.personal: Refreshing state... [id=alex.jackson:alex.jackson.policy]
module.f2_instance.aws_security_group_rule.allow_outbound_subnet_postgres: Refreshing state... [id=sgrule-3819120690]
module.demo_f2_instance.aws_security_group_rule.allow_outbound_subnet_postgres: Refreshing state... [id=sgrule-1972366629]
module.f2_instance.aws_iam_role_policy_attachment.this: Refreshing state... [id=f2-role-20231007085344887300000001]
module.demo_f2_instance.aws_iam_role_policy_attachment.this: Refreshing state... [id=demo-role-20231007192906185500000001]
module.f2_instance.aws_eip.this: Refreshing state... [id=eipalloc-088e677e1afd76c95]
aws_route53_record.opentracker: Refreshing state... [id=Z03017682LQ8TW5YUFGE0__A]
module.demo_f2_instance.aws_eip.this: Refreshing state... [id=eipalloc-0a8b4628189ab67ae]
module.demo_f2_instance.aws_eip.this: Drift detected (update)
module.demo_f2_instance.aws_security_group_rule.allow_outbound_ssh: Drift detected (update)
module.demo_f2_instance.aws_instance.this: Drift detected (update)
module.demo_f2_instance.aws_iam_instance_profile.this: Drift detected (update)
module.demo_f2_instance.aws_iam_role.this: Drift detected (update)
module.demo_f2_instance.aws_security_group.this: Drift detected (update)
module.demo_f2_instance.aws_iam_policy.this: Drift detected (update)

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  - destroy

Terraform will perform the following actions:

  # aws_route53_record.demo_opentracker will be destroyed
  - resource "aws_route53_record" "demo_opentracker" {
      - fqdn                             = "testing.opentracker.app" -> null
      - id                               = "Z03017682LQ8TW5YUFGE0_testing_A" -> null
      - multivalue_answer_routing_policy = false -> null
      - name                             = "testing" -> null
      - records                          = [
          - "52.16.130.122",
        ] -> null
      - ttl                              = 300 -> null
      - type                             = "A" -> null
      - zone_id                          = "Z03017682LQ8TW5YUFGE0" -> null
    }

  # aws_route53_record.opentracker_demo will be created
  + resource "aws_route53_record" "opentracker_demo" {
      + allow_overwrite = (known after apply)
      + fqdn            = (known after apply)
      + id              = (known after apply)
      + name            = "demo"
      + records         = [
          + "52.16.130.122",
        ]
      + ttl             = 300
      + type            = "A"
      + zone_id         = "Z03017682LQ8TW5YUFGE0"
    }

  # aws_route53_record.opentracker_testing will be created
  + resource "aws_route53_record" "opentracker_testing" {
      + allow_overwrite = (known after apply)
      + fqdn            = (known after apply)
      + id              = (known after apply)
      + name            = "testing"
      + records         = [
          + "52.16.130.122",
        ]
      + ttl             = 300
      + type            = "A"
      + zone_id         = "Z03017682LQ8TW5YUFGE0"
    }

Plan: 2 to add, 0 to change, 1 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>